---
kind: method
id: M:Autodesk.Revit.DB.PanelTypeSet.#ctor
source: html/d82eb6d0-46ff-c1e9-5390-7ee6bbe9294c.htm
---
# Autodesk.Revit.DB.PanelTypeSet.#ctor Method

Initializes a new instance of the PanelTypeSet class

## Syntax (C#)
```csharp
public PanelTypeSet()
```